c2f1413183766e104ce4b329feaad353/update/sys_soap_message_function_986a1dd2830ba6104ce4b329feaad380.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/incident">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:getRecords>
         <!--Optional:-->
         <active>${getRecords.active}</active>
         <!--Optional:-->
         <activity_due>${getRecords.activity_due}</activity_due>
         <!--Optional:-->
         <additional_assignee_list>${getRecords.additional_assignee_list}</additional_assignee_list>
         <!--Optional:-->
         <approval>${getRecords.approval}</approval>
         <!--Optional:-->
         <approval_history>${getRecords.approval_history}</approval_history>
         <!--Optional:-->
         <approval_set>${getRecords.approval_set}</approval_set>
         <!--Optional:-->
         <assigned_to>${getRecords.assigned_to}</assigned_to>
         <!--Optional:-->
         <assignment_group>${getRecords.assignment_group}</assignment_group>
         <!--Optional:-->
         <business_duration>${getRecords.business_duration}</business_duration>
         <!--Optional:-->
         <business_impact>${getRecords.business_impact}</business_impact>
         <!--Optional:-->
         <business_service>${getRecords.business_service}</business_service>
         <!--Optional:-->
         <business_stc>${getRecords.business_stc}</business_stc>
         <!--Optional:-->
         <calendar_duration>${getRecords.calendar_duration}</calendar_duration>
         <!--Optional:-->
         <calendar_stc>${getRecords.calendar_stc}</calendar_stc>
         <!--Optional:-->
         <caller_id>${getRecords.caller_id}</caller_id>
         <!--Optional:-->
         <category>${getRecords.category}</category>
         <!--Optional:-->
         <cause>${getRecords.cause}</cause>
         <!--Optional:-->
         <caused_by>${getRecords.caused_by}</caused_by>
         <!--Optional:-->
         <child_incidents>${getRecords.child_incidents}</child_incidents>
         <!--Optional:-->
         <close_code>${getRecords.close_code}</close_code>
         <!--Optional:-->
         <close_notes>${getRecords.close_notes}</close_notes>
         <!--Optional:-->
         <closed_at>${getRecords.closed_at}</closed_at>
         <!--Optional:-->
         <closed_by>${getRecords.closed_by}</closed_by>
         <!--Optional:-->
         <cmdb_ci>${getRecords.cmdb_ci}</cmdb_ci>
         <!--Optional:-->
         <comments>${getRecords.comments}</comments>
         <!--Optional:-->
         <comments_and_work_notes>${getRecords.comments_and_work_notes}</comments_and_work_notes>
         <!--Optional:-->
         <company>${getRecords.company}</company>
         <!--Optional:-->
         <contact_type>${getRecords.contact_type}</contact_type>
         <!--Optional:-->
         <contract>${getRecords.contract}</contract>
         <!--Optional:-->
         <correlation_display>${getRecords.correlation_display}</correlation_display>
         <!--Optional:-->
         <correlation_id>${getRecords.correlation_id}</correlation_id>
         <!--Optional:-->
         <delivery_plan>${getRecords.delivery_plan}</delivery_plan>
         <!--Optional:-->
         <delivery_task>${getRecords.delivery_task}</delivery_task>
         <!--Optional:-->
         <description>${getRecords.description}</description>
         <!--Optional:-->
         <due_date>${getRecords.due_date}</due_date>
         <!--Optional:-->
         <escalation>${getRecords.escalation}</escalation>
         <!--Optional:-->
         <expected_start>${getRecords.expected_start}</expected_start>
         <!--Optional:-->
         <follow_up>${getRecords.follow_up}</follow_up>
         <!--Optional:-->
         <group_list>${getRecords.group_list}</group_list>
         <!--Optional:-->
         <hold_reason>${getRecords.hold_reason}</hold_reason>
         <!--Optional:-->
         <impact>${getRecords.impact}</impact>
         <!--Optional:-->
         <incident_state>${getRecords.incident_state}</incident_state>
         <!--Optional:-->
         <knowledge>${getRecords.knowledge}</knowledge>
         <!--Optional:-->
         <location>${getRecords.location}</location>
         <!--Optional:-->
         <made_sla>${getRecords.made_sla}</made_sla>
         <!--Optional:-->
         <notify>${getRecords.notify}</notify>
         <!--Optional:-->
         <number>${getRecords.number}</number>
         <!--Optional:-->
         <opened_at>${getRecords.opened_at}</opened_at>
         <!--Optional:-->
         <opened_by>${getRecords.opened_by}</opened_by>
         <!--Optional:-->
         <order>${getRecords.order}</order>
         <!--Optional:-->
         <origin_id>${getRecords.origin_id}</origin_id>
         <!--Optional:-->
         <origin_table>${getRecords.origin_table}</origin_table>
         <!--Optional:-->
         <parent>${getRecords.parent}</parent>
         <!--Optional:-->
         <parent_incident>${getRecords.parent_incident}</parent_incident>
         <!--Optional:-->
         <priority>${getRecords.priority}</priority>
         <!--Optional:-->
         <problem_id>${getRecords.problem_id}</problem_id>
         <!--Optional:-->
         <reassignment_count>${getRecords.reassignment_count}</reassignment_count>
         <!--Optional:-->
         <reopen_count>${getRecords.reopen_count}</reopen_count>
         <!--Optional:-->
         <reopened_by>${getRecords.reopened_by}</reopened_by>
         <!--Optional:-->
         <reopened_time>${getRecords.reopened_time}</reopened_time>
         <!--Optional:-->
         <resolved_at>${getRecords.resolved_at}</resolved_at>
         <!--Optional:-->
         <resolved_by>${getRecords.resolved_by}</resolved_by>
         <!--Optional:-->
         <rfc>${getRecords.rfc}</rfc>
         <!--Optional:-->
         <route_reason>${getRecords.route_reason}</route_reason>
         <!--Optional:-->
         <service_offering>${getRecords.service_offering}</service_offering>
         <!--Optional:-->
         <severity>${getRecords.severity}</severity>
         <!--Optional:-->
         <short_description>${getRecords.short_description}</short_description>
         <!--Optional:-->
         <sla_due>${getRecords.sla_due}</sla_due>
         <!--Optional:-->
         <state>${getRecords.state}</state>
         <!--Optional:-->
         <subcategory>${getRecords.subcategory}</subcategory>
         <!--Optional:-->
         <sys_class_name>${getRecords.sys_class_name}</sys_class_name>
         <!--Optional:-->
         <sys_created_by>${getRecords.sys_created_by}</sys_created_by>
         <!--Optional:-->
         <sys_created_on>${getRecords.sys_created_on}</sys_created_on>
         <!--Optional:-->
         <sys_domain>${getRecords.sys_domain}</sys_domain>
         <!--Optional:-->
         <sys_domain_path>${getRecords.sys_domain_path}</sys_domain_path>
         <!--Optional:-->
         <sys_id>${getRecords.sys_id}</sys_id>
         <!--Optional:-->
         <sys_mod_count>${getRecords.sys_mod_count}</sys_mod_count>
         <!--Optional:-->
         <sys_updated_by>${getRecords.sys_updated_by}</sys_updated_by>
         <!--Optional:-->
         <sys_updated_on>${getRecords.sys_updated_on}</sys_updated_on>
         <!--Optional:-->
         <task_effective_number>${getRecords.task_effective_number}</task_effective_number>
         <!--Optional:-->
         <time_worked>${getRecords.time_worked}</time_worked>
         <!--Optional:-->
         <universal_request>${getRecords.universal_request}</universal_request>
         <!--Optional:-->
         <upon_approval>${getRecords.upon_approval}</upon_approval>
         <!--Optional:-->
         <upon_reject>${getRecords.upon_reject}</upon_reject>
         <!--Optional:-->
         <urgency>${getRecords.urgency}</urgency>
         <!--Optional:-->
         <user_input>${getRecords.user_input}</user_input>
         <!--Optional:-->
         <watch_list>${getRecords.watch_list}</watch_list>
         <!--Optional:-->
         <work_end>${getRecords.work_end}</work_end>
         <!--Optional:-->
         <work_notes>${getRecords.work_notes}</work_notes>
         <!--Optional:-->
         <work_notes_list>${getRecords.work_notes_list}</work_notes_list>
         <!--Optional:-->
         <work_start>${getRecords.work_start}</work_start>
         <!--Optional:-->
         <__use_view>${getRecords.__use_view}</__use_view>
         <!--Optional:-->
         <__encoded_query>${getRecords.__encoded_query}</__encoded_query>
         <!--Optional:-->
         <__limit>${getRecords.__limit}</__limit>
         <!--Optional:-->
         <__first_row>${getRecords.__first_row}</__first_row>
         <!--Optional:-->
         <__last_row>${getRecords.__last_row}</__last_row>
         <!--Optional:-->
         <__order_by>${getRecords.__order_by}</__order_by>
         <!--Optional:-->
         <__order_by_desc>${getRecords.__order_by_desc}</__order_by_desc>
         <!--Optional:-->
         <__exclude_columns>${getRecords.__exclude_columns}</__exclude_columns>
      </inc:getRecords>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>getRecords</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>Incident Integration [ getRecords ]</qualified_name>
        <soap_action>http://www.service-now.com/incident/getRecords</soap_action>
        <soap_endpoint>https://dev272006.service-now.com/incident.do?SOAP</soap_endpoint>
        <soap_message display_value="Incident Integration">efa89952830ba6104ce4b329feaad3d0</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>admin</sys_created_by>
        <sys_created_on>2025-08-01 06:19:32</sys_created_on>
        <sys_id>986a1dd2830ba6104ce4b329feaad380</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>getRecords</sys_name>
        <sys_package display_value="Right Prompt Travel App" source="x_1804233_right_pr">c2f1413183766e104ce4b329feaad353</sys_package>
        <sys_policy/>
        <sys_scope display_value="Right Prompt Travel App">c2f1413183766e104ce4b329feaad353</sys_scope>
        <sys_update_name>sys_soap_message_function_986a1dd2830ba6104ce4b329feaad380</sys_update_name>
        <sys_updated_by>admin</sys_updated_by>
        <sys_updated_on>2025-08-01 06:19:32</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
